-- Оконные функции.

-- 1. Создать таблицу и заполнить ее данными согласно [скрипту](sem_5_inserts.sql).

-- 2. Подсчитайте количество продуктов в каждой группе и вывести это в отдельном столбце для каждого продукта

-- 3. Найдите цену следующего продукта в группе, чтобы оценить изменения цен в рамках каждой группы продуктов.

-- 4. Определите процент отклонения цены каждого продукта от максимальной цены в своей группе.

-- 5. Выведите все товары и среднюю цену товара в каждой из групп в отдельном столбце. Ответ округлите до целого

-- 6. Найдите самый дешевый продукт в каждой группе и сопоставьте его цену с ценами других продуктов.

-- 7. Выведите номер товара в порядке возрастания цены в каждой группе. (т.е. нумерация отдельная для каждой группы)

-- 8. Повторите предыдущий шаг, но товары с одинаковой ценой должны иметь одинаковый порядковый номер.

-- 9. Выведите для каждого товара разность его цены с предыдущим в одной товарной категории.

-- 10. Создайте запрос, который анализирует тренд изменения цен для каждого продукта в группе и определяет, увеличивается ли цена, уменьшается, или остается неизменной, сравнивая с предыдущей ценой.

-- 11. Для каждого продукта укажите, есть ли в группе продукт с более высокой ценой.

-- 12. Вычислите накопительную сумму цен продуктов в каждой группе.

-- 13. Для оценки изменения цен продуктов используйте LAG и LEAD функции, анализируя, как изменяется цена по сравнению с предыдущей и следующей ценой того же продукта.

-- 14. Для каждого продукта в группе вычислите отклонение от средней цены продуктов в этой группе при помощи оконных функций.

-- 15.  Оценка динамики изменения цен. Отследите тенденции изменения цен для оценки общего направления изменения цен в группе (например, тренд к увеличению или уменьшению).

-- 16. Рассчитайте долю каждого продукта от суммарной цены группы и сравните с долей предыдущего продукта в группе.

-- 17. Рассчитайте скользящее среднее цен для каждого продукта с учетом трех предыдущих и текущей строки в рамках своей группы.
