-- Оконные функции.

--1. Создать таблицу и заполнить ее данными согласно скрипту.

--2. Вывести все товары и среднюю цену товара в каждой из категорий в отдельном столбце. Ответ округлить до целого.


--3. Вывести номер товара в порядке возрастания цены в каждой группе.


--4. Повторить предыдущий шаг, но товары с одинаковой ценой должны иметь одинаковый порядковый номер.


--5. Вывести для каждого товара разность его цены с предыдущим в одной товарной категории.


--6. Для каждого товара вывести наименьшую стоимость в данной товарной категории.
