-- Оконные функции.

-- 1. Создать таблицу и заполнить ее данными согласно [скрипту](sem_5_inserts.sql).

-- 2. Подсчитайте количество продуктов в каждой группе и выведите это в отдельном столбце для каждого продукта

-- 3. Выведите все товары и среднюю цену товара в каждой из групп в отдельном столбце. Ответ округлите до целого

-- 4. Найдите цену следующего продукта (в порядке сортировки по цене) в группе, чтобы оценить изменения цен в рамках каждой группы продуктов.

-- 5. Выведите для каждого товара разность его цены с предыдущим в одной товарной категории.

-- 6. Найдите самый дешевый продукт в каждой группе и сопоставьте его цену с ценами других продуктов.

-- 7. Определите процент отклонения цены каждого продукта от максимальной цены в своей группе.

-- 8. Выведите номер товара в порядке возрастания цены в каждой группе. (т.е. нумерация отдельная для каждой группы)

-- 9. Повторите предыдущий шаг, но товары с одинаковой ценой должны иметь одинаковый порядковый номер.

-- 10. Для каждого продукта укажите, есть ли в группе продукт с более высокой ценой.

-- 11. Вычислите накопительную сумму цен продуктов в каждой группе.

-- 12. Рассчитайте долю каждого продукта от суммарной цены группы и сравните с долей предыдущего продукта в группе.

-- 13. Рассчитайте скользящее среднее цен для каждого продукта с учетом трех предыдущих и текущей строки в рамках своей группы.
